content/posts/new-page.org
#+title: new post

#+BEGIN_PREVIEW
test preview contextLorem ipsum dolor sit amet, consectetur adipiscing elit. Donec eu est at mauris pulvinar tincidunt. Maecenas odio urna, auctor quis tellus non, viverra hendrerit mauris. Nulla posuere luctus interdum. Sed efficitur semper dolor quis aliquet. Nam ut posuere mauris. Fusce porttitor nibh id neque facilisis, nec porttitor turpis fermentum. Duis scelerisque, lectus a vulputate fringilla, risus urna dictum mauris, sed euismod lectus erat vel nisl. Duis nibh justo, tempor in rutrum ut, fermentum in metus.
#+END_PREVIEW

** this is a page post

** Welcome
#+begin_src elisp
 (setq funcname "value")
#+end_src

#+begin_src js

export const add(a, b) {
    return a + b
}
#+end_src

** some more