posts/new-page.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-30 Fri 03:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>new post</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="preamble" class="status">
<nav>
    <div>Lighthouse - Michael</div>
    <ul class="navbar">
        <li><a href="/">Home</a></li>
        <li><a href="/">Profile</a></li>
        <li><a href="/">About</a></li>
    </ul>
</nav>
</div>
<div id="content">
<h1 class="title">new post</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org49a3bf7">this is a page post</a></li>
<li><a href="#org2b31ffd">Welcome</a></li>
<li><a href="#org9253c12">some more</a></li>
</ul>
</div>
</div>
<div class="PREVIEW">
<p>
test preview contextLorem ipsum dolor sit amet, consectetur adipiscing elit. Donec eu est at mauris pulvinar tincidunt. Maecenas odio urna, auctor quis tellus non, viverra hendrerit mauris. Nulla posuere luctus interdum. Sed efficitur semper dolor quis aliquet. Nam ut posuere mauris. Fusce porttitor nibh id neque facilisis, nec porttitor turpis fermentum. Duis scelerisque, lectus a vulputate fringilla, risus urna dictum mauris, sed euismod lectus erat vel nisl. Duis nibh justo, tempor in rutrum ut, fermentum in metus.
</p>

</div>

<div id="outline-container-org49a3bf7" class="outline-2">
<h2 id="org49a3bf7">this is a page post</h2>
</div>

<div id="outline-container-org2b31ffd" class="outline-2">
<h2 id="org2b31ffd">Welcome</h2>
<div class="outline-text-2" id="text-org2b31ffd">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">setq</span> funcname <span style="font-style: italic;">"value"</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-js">
<span style="font-weight: bold;">export</span> <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">add</span>(a, b) {
    <span style="font-weight: bold;">return</span> a + b
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org9253c12" class="outline-2">
<h2 id="org9253c12">some more</h2>
</div>
</div>
<div id="postamble" class="status">
<footer>
    footer area
</footer>
</div>
</body>
</html>
